In [2]:
import pandas as pd

In [3]:
df = pd.DataFrame(columns=["Name", "Age", "Height"])

In [4]:
df

Empty DataFrame
Columns: [Name, Age, Height]
Index: []

In [5]:
df.loc[0] = ["Allen", 22, 175]

In [6]:
df

    Name  Age  Height
0  Allen   22     175

## Do something
- subtitle1
- subtitle2

In [7]:
df.loc[1] = ["Tde", 25, 180]
df

    Name  Age  Height
0  Allen   22     175
1    Tde   25     180

In [8]:
df["Weight"] = [75, 80]
df

    Name  Age  Height  Weight
0  Allen   22     175      75
1    Tde   25     180      80

In [9]:
df["Weight"] = 85
df

    Name  Age  Height  Weight
0  Allen   22     175      85
1    Tde   25     180      85

In [10]:
df.drop("Weight", axis=1)

    Name  Age  Height
0  Allen   22     175
1    Tde   25     180

In [11]:
df

    Name  Age  Height  Weight
0  Allen   22     175      85
1    Tde   25     180      85

In [12]:
df = df.drop("Weight", axis=1)
df

    Name  Age  Height
0  Allen   22     175
1    Tde   25     180

In [13]:
df

    Name  Age  Height
0  Allen   22     175
1    Tde   25     180

In [14]:
df.drop(1)

    Name  Age  Height
0  Allen   22     175

In [15]:
df

    Name  Age  Height
0  Allen   22     175
1    Tde   25     180

In [16]:
df["Height"]

0    175
1    180
Name: Height, dtype: int64

In [17]:
df["Height"][0]

np.int64(175)

In [18]:
df["Height"][0] = 178
df

/tmp/ipykernel_48175/1696690987.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df["Height"][0] = 178

    Name  Age  Height
0  Allen   22     178
1    Tde   25     180

In [19]:
columns = ["Name", "Age", "Height"]
data = [
    ["Judy", 28, 60],
    ["Trump", 30, 77],
]

new_df = pd.DataFrame(
    data=data,
    columns=columns,
)

new_df

    Name  Age  Height
0   Judy   28      60
1  Trump   30      77

In [20]:
pd.concat(
    [df, new_df],
)

    Name  Age  Height
0  Allen   22     178
1    Tde   25     180
0   Judy   28      60
1  Trump   30      77

In [21]:
df_concat = pd.concat(
    [df, new_df],
)

df_concat

    Name  Age  Height
0  Allen   22     178
1    Tde   25     180
0   Judy   28      60
1  Trump   30      77

In [22]:
df_concat.reset_index(drop=True)

    Name  Age  Height
0  Allen   22     178
1    Tde   25     180
2   Judy   28      60
3  Trump   30      77

In [23]:
df_concat = df_concat.reset_index(drop=True)

df_concat

    Name  Age  Height
0  Allen   22     178
1    Tde   25     180
2   Judy   28      60
3  Trump   30      77

In [24]:
df_concat["Name"]

0    Allen
1      Tde
2     Judy
3    Trump
Name: Name, dtype: object

In [25]:
df_new = df_concat

In [26]:
df_new["Age"] = 30

In [27]:
df_new

    Name  Age  Height
0  Allen   30     178
1    Tde   30     180
2   Judy   30      60
3  Trump   30      77

In [28]:
df_concat

    Name  Age  Height
0  Allen   30     178
1    Tde   30     180
2   Judy   30      60
3  Trump   30      77

In [29]:
df_new = df_concat.copy()

In [30]:
df_new["Age"] = 35
df_new

    Name  Age  Height
0  Allen   35     178
1    Tde   35     180
2   Judy   35      60
3  Trump   35      77

In [31]:
df_concat

    Name  Age  Height
0  Allen   30     178
1    Tde   30     180
2   Judy   30      60
3  Trump   30      77